In [21]:
import numpy as np
import json,folium
import pandas as pd
import folium

In [22]:
df = pd.read_csv('data/경기도 도시공원정보표준데이터.csv', encoding='euc-kr')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17525 entries, 0 to 17524
Data columns (total 19 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   관리번호          17525 non-null  object
 1   공원명           17525 non-null  object
 2   공원구분          17525 non-null  object
 3   소재지도로명주소      3692 non-null   object
 4   소재지지번주소       17335 non-null  object
 5   위도            17513 non-null  float64
 6   경도            17514 non-null  float64
 7   공원면적          17525 non-null  float64
 8   공원보유시설(운동시설)  4821 non-null   object
 9   공원보유시설(유희시설)  6200 non-null   object
 10  공원보유시설(편익시설)  4842 non-null   object
 11  공원보유시설(교양시설)  805 non-null    object
 12  공원보유시설(기타시설)  2577 non-null   object
 13  지정고시일         14451 non-null  object
 14  관리기관명         16033 non-null  object
 15  전화번호          16343 non-null  object
 16  데이터기준일자       17525 non-null  object
 17  제공기관코드        17525 non-null  object
 18  제공기관명         17525 non-null  object
dtypes: float64(3), object(16)
memory usage: 2.5+ MB

In [23]:
df = df[['소재지지번주소','공원면적']]
df.columns =['주소','공원면적']
df.head(10)

                    주소     공원면적
0  서울특별시 용산구 효창동 287-6   1569.9
1                  NaN   1820.0
2                  NaN   1037.0
3                  NaN   4928.0
4                  NaN   3575.0
5                  NaN  71559.0
6                  NaN  22821.0
7                  NaN   6075.0
8                  NaN  23751.0
9                  NaN  20559.0

In [24]:
df.dropna(axis=0,inplace=True)
df.head()

                      주소     공원면적
0    서울특별시 용산구 효창동 287-6   1569.9
23     서울특별시 용산구 이촌동 408   1766.0
24  서울특별시 용산구 한강로1가 30-3   2090.0
25     서울특별시 용산구 신창동 100    257.0
26  서울특별시 용산구 용산동5가 24-2  11879.0

In [25]:
df=df[df.주소.str.contains('경기도')&df.주소.str.contains('구')]
df.tail()

                        주소     공원면적
17021  경기도 용인시 기흥구 신갈동 708   1502.0
17022  경기도 용인시 기흥구 신갈동 683  36854.0
17023  경기도 용인시 기흥구 신갈동 699  23081.0
17024  경기도 용인시 기흥구 중동 1082   1500.0
17025  경기도 용인시 기흥구 중동 1083   1500.0

In [26]:
df['시군구'] = df.주소.apply(lambda x: ''.join(x.split()[1:3]))
df.tail()

In [28]:
my_list = []
for i in range(df.주소):
    x = df.loc[i, '주소']
    df.loc[i, '시군구'] = ''.join(x.split()[1:3])
    my_list.append(df['시군구'])
else:
    df.loc[i, '시'] = ''.join(x.split()[1:])
    my_list.append(df['시군구'])

TypeError: 'Series' object cannot be interpreted as an integer